tap "gcenx/wine"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "sidneys/homebrew"
tap "teamookla/speedtest"
# Download with resuming and segmented downloading
brew "aria2"
# Core application library for C
brew "glib"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Freely available high-quality data compressor
brew "bzip2"
# Extract files from Microsoft cabinet files
brew "cabextract"
# Manage compile and link flags for libraries
brew "pkg-config"
# Low-level library for pixel manipulation
brew "pixman"
# CD/DVD/Blu-ray premastering and recording software
brew "cdrtools"
# Cross-platform make
brew "cmake"
# Dependency manager for Cocoa projects
brew "cocoapods"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Generic library support script
brew "libtool"
# GNU Emacs text editor
brew "emacs"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Libpcap-based NetFlow probe
brew "fprobe"
# GNU compiler collection
brew "gcc"
# Distributed revision control system
brew "git"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# SMART hard drive monitoring
brew "smartmontools"
# Graphical user interface for smartctl
brew "gsmartcontrol"
# GUI toolkit
brew "gtk+"
# World's fastest and most advanced password recovery utility
brew "hashcat"
# Improved top (interactive process viewer)
brew "htop"
# Spell checker and morphological analyzer
brew "hunspell"
# Portable library for network traffic capture
brew "libpcap"
# General purpose TCP-IP emulator
brew "libslirp"
# Library for support vector machines
brew "libsvm"
# Library for USB device access
brew "libusb"
# X.Org: X Pixmap (XPM) image file format library
brew "libxpm"
# Next-gen compiler infrastructure
brew "llvm"
# Utility for directing compilation
brew "make"
# Development kit for the Java programming language
brew "openjdk"
# Java-based project management
brew "maven"
# Netwide Assembler (NASM) is an 80x86 assembler
brew "nasm"
# NCurses Disk Usage
brew "ncdu"
# Fast, highly customisable system info script
brew "neofetch"
# Small build system for use with gyp or CMake
brew "ninja"
# Platform built on V8 to build network applications
brew "node"
# Python interface to Tcl/Tk
brew "python-tk@3.10"
# Library for loading images as SDL surfaces and textures
brew "sdl2_image"
# Image file loading library
brew "sdl_image"
# User interface to the TELNET protocol
brew "telnet"
# Compress/expand executable files
brew "upx"
# Vi 'workalike' with many additional features
brew "vim"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# Internet file retriever
brew "wget"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Automatic workarounds for problems in Wine
brew "winetricks"
# Cross-platform C++ GUI toolkit
brew "wxwidgets"
# Python bindings for wxWidgets
brew "wxpython"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Next-generation plugin manager for zsh
brew "zplug"
# UNIX shell (command interpreter)
brew "zsh"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# Audio utility
cask "background-music"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Voice and text chat software
cask "discord"
# Tool to hide status bar icons
cask "dozer"
# UI toolkit for building applications for mobile, web and desktop
cask "flutter"
# Keyboard customizer
cask "karabiner-elements"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# Finds large, unwanted files and deletes them
cask "omnidisksweeper"
# Retro video game emulation
cask "openemu"
# Rhythm game
cask "osu"
# Control your tools with a few keystrokes
cask "raycast"
# Emulator frontend (OpenGL graphics API version)
cask "retroarch"
# Team communication and collaboration software
cask "slack"
# System monitor for the menu bar
cask "stats"
# Unpacks archive files
cask "the-unarchiver"
# To-do & task list manager
cask "ticktick"
# Open-source BitTorrent client
cask "transmission"
# Virtual machines UI using QEMU
cask "utm"
# Tool to hide menu bar icons
cask "vanilla"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Torrent client
cask "xtorrent"
# Video communication and virtual meeting platform
cask "zoom"
